[
  {
    "id": "_meta",
    "name": "Twisted Fates v1.10",
    "author": "Zobody",
    "logo": "https://i.ibb.co/w7xMHc5/script-icon.png",
    "github": "https://github.com/JulGvoz/twisted-fates",
    "helpers": [
      "emptyset#9999",
      "Sodium#6176"
    ],
    "iconCredit": [
      "<https://game-icons.net>"
    ],
    "homebrewRules": [
      "There are 3 alignments/teams: good, evil and fated, and 3 character types:",
      "- [Peacebrokers](#Peacebroker) start good.",
      "- [Vile](#Vile) start evil.",
      "- [Fatebound](#Fatebound) start fated.",
      "",
      "Good team wins when all evils die. ",
      "",
      "Evil team wins when all fated die. ",
      "",
      "Fated team wins when all good die.",
      "",
      "Team that wins | Team that died out",
      "-|-",
      "Good|Evil",
      "Evil|Fated",
      "Fated|Good",
      "",
      "Game immediately ends when all players in any of the teams are dead.",
      "",
      "### Setup",
      "Players | Peacebroker | Fatebound | Vile",
      "-|-|-|-",
      "5|2|2|1",
      "6|2|2|2",
      "7|3|2|2",
      "8|3|3|2",
      "9|3|3|3",
      "10|4|3|3",
      "11|4|4<sup>\\[\\*\\]</sup>|4<sup>\\[\\*\\]</sup>",
      "",
      "<sup>\\[\\*\\]</sup>",
      "Because Sleepwalker must be in the game, put in all character tokens except the Sleepwalker in the bag, and then assign the \"Sleepwalker\" reminder token to a Vile or a Fatebound player.",
      ""
    ],
    "teams": {
      "peacebroker": [
        "*Peaceful beings and forces of nature. Existing in the realm of the living, they are suddenly disturbed by vile creatures.*",
        "",
        "<img src=\"https://raw.githubusercontent.com/bra1n/townsquare/main/src/assets/icons/good.png\" alt=\"good\" width=\"150\">",
        "",
        "Peacebrokers start on the **good** team. They win when all players on the **evil** team die.",
        ""
      ],
      "vile": [
        "<img src=\"https://raw.githubusercontent.com/bra1n/townsquare/main/src/assets/icons/evil.png\" alt=\"evil\" width=\"150\">",
        ""
      ],
      "fatebound": [
        "*Forthbringers of progress, these humans have discovered a way of tampering with fate, thus embedding themselves in it. Now they have a mission of bringing down the natural order and instilling purity into the world.*",
        "",
        "<img src=\"https://raw.githubusercontent.com/JulGvoz/twisted-fates/master/original-icons/fated.png\" alt=\"fated\" width=\"100\">",
        ""
      ]
    }
  },
  {
    "image": "https://raw.githubusercontent.com/JulGvoz/twisted-fates/master/arranged/zenith.png",
    "id": "zenith",
    "team": "peacebroker",
    "name": "Zenith",
    "firstNight": 0,
    "otherNight": 5,
    "reminders": [
      "Safe"
    ],
    "ability": "Each night*, choose any number of players: if they are on the same team, they cannot die tonight.",
    "blurb": "**Zenith** can protect players of the same alignment.",
    "explanations": [
      "Zenith does not care about character type, only on alignment.",
      "If a character states that someone dies tonight, players protected by Zenith cannot die from that character.",
      "If a character states that someone dies tonight and all viable characters are protected by Zenith, nobody can die (this situation doesn't arrive in practice, as there are always at least 2 players not protected).",
      "Zenith may any number of players: 0 players (choosing not to act), 1 player (can pick themselves or someone else), 2 players or more players (can include or exclude themselves).",
      "Zenith can choose dead players."
    ],
    "examples": [
      "Zenith chooses themselves. Cutthroat targets them, but Zenith does not die.",
      "Zenith was marked by Neolith the previous night, and another marked player died today. Zenith chooses themselves and Calamity, but Calamity is killed by the Savage.",
      "Zenith chooses the Apostle and Cutthroat. Neither of them are protected, because they are on different teams. The Neolith's ability kills the Apostle.",
      "Zenith chooses the Weaver tonight. Cutthroat tries to kill the Weaver, but Weaver survives.",
      "Zenith chose themselves tonight. The next day, Calamity is executed. Zenith is killed by Calamity's ability."
    ]
  },
  {
    "image": "https://raw.githubusercontent.com/JulGvoz/twisted-fates/master/arranged/calamity.png",
    "id": "calamity",
    "team": "peacebroker",
    "name": "Calamity",
    "reminders": [
      "Revive",
      "Die",
      "Used"
    ],
    "ability": "The 1st time you are executed (not the 1st day), all living players die & all dead players come back to life. You stay dead.",
    "blurb": "**Calamity** causes living and dead to flip if someone dares to execute them.",
    "explanations": [
      "If Calamity is executed during the 1st day, nothing happens, and their ability is used up.",
      "Calamity's ability can often end in multiple teams dying out. In that case, multiple teams win.",
      "Calamity being executed while dead does nothing, since they have no ability while dead.",
      "Your ability triggers before the game ends (so if all other players of your alignment were dead, they will become alive and the game will not end)"
    ],
    "examples": [
      "Good Apostle and Cutthroat are dead, Mangler, Neolith, Zenith and Calamity are alive. Calamity is executed. Now Good Apostle and Cutthroat are alive, everyone else is dead. All fated are dead, so the game ends, and evil wins.",
      "Calamity is executed on the first day. Calamity's ability does not trigger.",
      "Zenith, Seeker and Savage are dead, meanwhile Calamity, Sleepwalker, Cutthroat and Mangler are alive. Calamity is executed. Now Zenith, Seeker and Savage are alive, Calamity, Sleepwalker, Cutthroat and Mangler are dead. Zenith, Seeker and Savage are all on different teams, so the game continues and goes into night.",
      "Calamity is poisoned by Neolith. Calamity is executed, but nothing happens."
    ]
  },
  {
    "image": "https://raw.githubusercontent.com/JulGvoz/twisted-fates/master/arranged/elixir.png",
    "id": "elixir",
    "team": "peacebroker",
    "name": "Elixir",
    "reminders": [
      "Safe"
    ],
    "ability": "You cannot die from execution if you were nominated by a fated.",
    "blurb": "**Elixir** is protected from fated alignment players during executions.",
    "explanations": [
      "If a good or evil Fatebound nominated and executed them, Elixir's ability does not trigger.",
      "If fated Vile or Peacebroker nominated and executed them, Elixir is executed but does not die."
    ],
    "examples": [
      "Elixir is nominated by fated Seeker, and put on the block. Nobody else is put on the block. Elixir is executed, but survives.",
      "Elixir is nominated by fated Apostle, and put on the block. Later, Cutthroat is put on the block and executed. Elixir's ability does not trigger.",
      "Elixir is nominated by fated Cutthroat, and put on the block. Nobody else is put on the block. Elixir is executed, but survives.",
      "Elixir is nominated by evil Seeker. Elixir is executed and dies."
    ]
  },
  {
    "image": "https://raw.githubusercontent.com/JulGvoz/twisted-fates/master/arranged/sleepwalker.png",
    "id": "sleepwalker",
    "team": "peacebroker",
    "name": "Sleepwalker",
    "setup": true,
    "remindersGlobal": [
      "Sleepwalker"
    ],
    "ability": "You do not know you are a Peacebroker. You think that you are either Vile or Fatebound.",
    "explanations": [
      "During setup, the Sleepwalker's token does not go in the bag. Instead, a Vile or Fatebound character goes in the bag (Your choice), and the player who draws that token is secretly the Sleepwalker for the whole game. You know. They do not.",
      "If you put an extra Vile token, the Sleepwalker must be a Vile. Accordingly with Fatebound.",
      "Sleepwalker has no ability. Whenever their Vile or Fatebound ability would affect the game in some way, it doesn't. However, you pretend that they are the character they think they are. If that character would wake at night, wake the Sleepwalker instead and act as if they were that character. If that character would gain information, you may give them false information instead - and you're encouraged to do so.",
      "The Sleepwalker begins thinking they are evil (if given a Vile token) or fated (if given a Fatebound token). If their ability can change their alignment, you may lie to them about their new alignment.",
      "If the Sleepwalker thinks their ability couldn't modify their alignment, you cannot lie to them about their alignment other than them thinking that they are their normal starting alignment. If they think they are Vile (and evil), and they turn evil, do not notify them of an alignment change (accordingly with Fatefound and fated). If they would turn good, tell them they became good.",
      "You may give explicit indication that Sleepwalker is the Sleepwalker through their information."
    ],
    "examples": [
      "Sleepwalker, who thinks they are Cutthroat, targets the Seeker, but nobody dies tonight.",
      "Sleepwalker, who thinks they are Seeker, sees the evil Cutthroat as fated. Later the Cutthroat is executed, and Sleepwalker sees themselves as good, even though they think they are fated.",
      "Sleepwalker, who thinks they are Weaver, sees Cutthroat as Calamity, Calamity as Sleepwalker who thinks they are Seeker, Savage as Savage, Seeker as Zenith and Apostle as Neolith. Later, Sleepwalker dies, then Calamity revives them. They wake up to see all characters as Savages - proving to them that they are a Sleepwalker.",
      "Sleepwalker, who thinks they are Neolith, marked the Apostle. Apostle didn't die tonight, but nobody dies from the Neolith ability."
    ]
  },
  {
    "image": "https://raw.githubusercontent.com/JulGvoz/twisted-fates/master/arranged/cutthroat.png",
    "id": "cutthroat",
    "team": "vile",
    "name": "Cutthroat",
    "firstNight": 0,
    "otherNight": 35,
    "reminders": [
      "Nominated",
      "Dies"
    ],
    "ability": "Each night*, choose a player who was nominated today: they die.",
    "blurb": "**Cutthroat** threathens and scares people into nominating after being nominated by the fear of death.",
    "explanations": [
      "If nobody was nominated today, Cutthroat does not wake tonight.",
      "Cutthroat may choose a dead player if a dead player was nominated today."
    ],
    "examples": [
      "Mangler and Zenith were nominated today. Cutthroat wakes, but has forgotten who were nominated. They try choosing the Savage, but Storyteller indicates \"no\", then points to viable players. Cutthroat then chooses Mangler, who dies.",
      "Nobody was nominated today. Cutthroat does not wake. Nobody dies today.",
      "Dead Calamity and Cutthroat were nominated today. Cutthroat chooses the dead Calamity.",
      "Only Cutthroat was nominated today. Cutthroat is forced to kill themselves today.",
      "Cutthroat attacks the Calamity, but Zenith chose Calamity and Zenith that night. Nobody dies.",
      "Seeker was nominated today. Cutthroat chooses Seeker. Seeker dies."
    ]
  },
  {
    "image": "https://raw.githubusercontent.com/JulGvoz/twisted-fates/master/arranged/savage.png",
    "id": "savage",
    "team": "vile",
    "name": "Savage",
    "firstNight": 0,
    "otherNight": 45,
    "reminders": [
      "Last executee",
      "Dies"
    ],
    "ability": "Each night*, choose a player: if they are not on the same team as last executee, they die.",
    "blurb": "**Savage** equalizes the game, by killing players of different alignements than those that were executed today.",
    "explanations": [
      "Savage wakes each night starting with 2nd night, and chooses a player.",
      "When a player is executed, place the \"Last executee\" reminder token near them.",
      "If nobody was executed today, the \"Last executee\" token remains on the last player.",
      "If nobody was executed in the game yet, Savage can kill anyone.",
      "If Savage is brought back to life later in the game, retroactively place the \"Last executee\" reminder token on the approipriate player."
    ],
    "examples": [
      "On the 1st day, nobody was executed. Savage chooses the Apostle, Apostle dies.",
      "Today, good Calamity was executed and Savage is brought back to life. Savage can only kill evil or fated player tonight.",
      "Today evil Apostle was executed. Savage chooses Cutthroat, who doesn't die.",
      "On the 1st day good Zenith was executed, but nobody was executed on the 2nd day. Tonight, Savage choose the good Calamity, who doesn't die, because they were on the same team as the last executee, who was the good Zenith.",
      "Cutthroat was executed today, and Savage decides to target the dead Cutthroat to hide a kill."
    ]
  },
  {
    "image": "https://raw.githubusercontent.com/JulGvoz/twisted-fates/master/arranged/wanton.png",
    "id": "wanton",
    "team": "vile",
    "name": "Wanton",
    "firstNight": 0,
    "otherNight": 15,
    "reminders": [
      "Evil nominated today",
      "Dies"
    ],
    "ability": "Each night*, if you nominated today, all other non-evil players are poisoned tonight. Otherwise, a player dies tonight.",
    "blurb": "**Wanton** wages their bets between poisoning others and exposing themselves.",
    "explanations": [
      "If you did not nominate today, the Storyteller choses a living player who can die today to die.",
      "Wanton poisons good and fated players (but not themselves), regardless of character type..",
      "Wanton only poisons during the night, and doesn't influence day abilities."
    ],
    "examples": [
      "Good Wanton nominated the Seeker today. During night, Zenith protects themselves and Calamity, but evil Cutthroat still kills Zenith, because Zenith is poisoned tonight by the good Wanton.",
      "All living players except the Wanton nominated today. Storyteller decides to kill Zenith.",
      "Nobody nominated today. Zenith is protecting themselves and Calamity, so Storyteller has to kill someone between Wanton and Weaver. Storyteller decides to kill Wanton.",
      "Fated Wanton nominated Zenith today and later Weaver nominated Elixir. Elixir is nominated but does not die. Tonight, Seeker's known target died, they learn Wanton and see \"Good\", because they are poisoned by the Wanton."
    ]
  },
  {
    "image": "https://raw.githubusercontent.com/JulGvoz/twisted-fates/master/arranged/neolith.png",
    "id": "neolith",
    "team": "vile",
    "name": "Neolith",
    "firstNight": 25,
    "otherNight": 25,
    "reminders": [
      "Marked",
      "Dies",
      "Poisoned"
    ],
    "ability": "Each night, mark a player (not yourself). If a marked player died today, all marked players are poisoned until dusk & a player dies tonight.",
    "blurb": "Neolith slowly marks players, unleashing a surprise attack if they show any weakness.",
    "explanations": [
      "When players are marked, they remain marked until the end of the game.",
      "When Neolith dies, \"Marked\" reminder tokens are removed",
      "Players remain marked even if they die.",
      "Neolith wakes even if a marked player died.",
      "If a marked player died today, when neolith marks another player, that player is also poisoned.",
      "Storyteller chooses who Neolith kills. Neolith does not learn of the target."
    ],
    "examples": [
      "Neolith choose Sleepwalker on the 1st night. Today, Sleepwalker was executed. Neolith's ability causes a player to die, and thus Storyteller chooses Apostle to die.",
      "Neolith has marked Apostle and Elixir already. This night, Wanton killed Elixir, and Neolith chooses the Wanton. Because none of marked players died during day, Neolith doesn't poison or kill anyone tonight.",
      "Neolith has marked Weaver, Calamity and Cutthroat already. Today, Cutthroat was executed. Tonight, Neolith chooses Seeker. Weaver, Calamity, dead Cutthroat and Seeker are all poisoned. Storyteller chooses to kill the Seeker.",
      "Neolith has marked the Mangler and Cutthroat so far. Last night, Cutthroat died. Today, Mangler was executed, and Cutthroat came back to life. Tonight, Cutthroat is poisoned by Neolith, and Neolith's ability kills the Cutthroat."
    ]
  },
  {
    "image": "https://raw.githubusercontent.com/JulGvoz/twisted-fates/master/arranged/weaver.png",
    "id": "weaver",
    "team": "fatebound",
    "name": "Weaver",
    "firstNight": 5,
    "otherNight": 0,
    "ability": "You start knowing all other players & their characters. Players of your alignment register falsely to you.",
    "blurb": "Weaver knows the fate of all but their own.",
    "explanations": [
      "Storyteller can send the Weaver a fake Grimoire when playing online.",
      "If Weaver is fated, all fated players (usually those who have Fatebound character) must be replaced with another character.",
      "When registering falsely, characters can appear as anything else, including another character for the same character type.",
      "If there is a Sleepwalker who thinks that they are Fatebound, fated Weaver simply learns Sleepwalker for that player.",
      "Storyteller may tell (or sometimes even be forced to tell) Weaver the same character 2 or more times.",
      "Weaver does not learn of any reminder or alignment tokens, just the characters of players."
    ],
    "examples": [
      "Weaver, Apostle, Elixir, Sleepwalker who thinks they are the Seeker, Wanton and Cutthroat are in play. Weaver wakes on 1st night to learn Apostle as Seeker (must register falsely), Elixir as Elixir, Sleepwalker as Sleepwalker, Wanton as Wanton and Cutthroat as Cutthroat. Note that only Apostle registered falsely.",
      "Evil Weaver has been brought back to life by Calamity. They wake first in the night, before any other roles (even though Neolith is alive now). They see Elixir as Elixir, evil Mangler as Calamity, fated Sleepwalker as Sleepwalker, evil Calamity as Mangler and fated Apostle as Apostle.",
      "Weaver, Seeker, Mangler, Elixir, Calamity, Zenith, Cutthroat, Savage and Wanton are in play. Weaver wakes on 1st night to learn: Seeker as Sleepwalker, Mangler as Neolith, Elixir as Elixir, Calamity as Calamity, Zenith as Zenith, Cutthroat as Cutthroat, Savage as Savage and Wanton as Wanton. Because of lack of ability to tell apart who is just registering wrong, Weaver doesn't know their teammates."
    ]
  },
  {
    "image": "https://raw.githubusercontent.com/JulGvoz/twisted-fates/master/arranged/seeker.png",
    "id": "seeker",
    "team": "fatebound",
    "name": "Seeker",
    "firstNight": 15,
    "otherNight": 45,
    "reminders": [
      "Known",
      "Learn another"
    ],
    "ability": "You start knowing a player & their alignment. When the player you know dies, you learn another.",
    "blurb": "Seeker searches for a person who's fate they can accept... killing all the others in the process. They always know the alignment of a player, and each time the player they know dies, they learn another.",
    "explanations": [
      "The Storyteller can show the Seeker themselves (not recommended).",
      "Seeker only wakes if the player who they knew died before them during night or day.",
      "If Seeker would die tonight, they cannot learn another player.",
      "If the player Seeker knows changes alignment, Seeker does not learn this."
    ],
    "examples": [
      "On the 1st night, Seeker learns that Alice (who is Mangler) is fated. On the 3rd night, Alice died, so Seeker later learns that Bob (who is the Cutthroat) is evil.",
      "Seeker starts knowing that Charlie (who is Elixir) is good. Seeker tries to execute Charlie, but they do not die (due to Elixir ability). Seeker doesn't learn anything during night, because the player they know hasn't died yet.",
      "Seeker starts knowing that Diana (who is Savage) is evil. The next night, Mangler swaps turns Seeker evil and Savage fated. Seeker still thinks that Diana is evil.",
      "Seeker starts knowing that Elana (who is Sleepwalker who thinks they are Wanton) is good. On the 1st day, Seeker is executed and on 2nd day, Calamity is executed, and Seeker is brought back to life. Sleepwalker was also brought back to life. Seeker wakes that night and learns that dead Calamity is good."
    ]
  },
  {
    "image": "https://raw.githubusercontent.com/JulGvoz/twisted-fates/master/arranged/mangler.png",
    "id": "mangler",
    "team": "fatebound",
    "name": "Mangler",
    "firstNight": 0,
    "otherNight": 65,
    "ability": "Each night*, choose 2 players (not yourself): they swap alignments. If 4 or fewer players live, you do not wake.",
    "blurb": "Mangler twists people's fates, tangling them in a web.",
    "explanations": [
      "After Mangler makes their choice, if the players they chose have different alignments, wake each of them separately and tell them of their alignment change.",
      "If Mangler causes all players of a team to become dead, the game ends.",
      "If Mangler chooses 2 players of the same alignment, nothing happens.",
      "If night started with more than 4 players alive, but when Mangler acts enough players died so that only 4 or 3 players live, Mangler doesn't wake.",
      "If at some point there were only 3 or 4 players alive (thus Mangler didn't wake), and later there are 5 or more players alive, Mangler can wake again."
    ],
    "examples": [
      "On the 2nd night, Mangler chooses now evil Apostle and fated Seeker. Apostle wakes again (they woke this night already to learn they became evil) to learn that they are now fated. Afterward, Seeker is woken to learn that they are now evil.",
      "Mangler chooses evil Calamity and Cutthroat. Since both of them have the same alignment, nothing happens.",
      "Mangler chooses good Sleepwalker who thinks they are Apostle and evil Cutthroat. Cutthroat learns they are now good, but Storyteller decides to lie to Sleepwalker (because Sleepwalker thinks they are Apostle) and tell them they are now good.",
      "Seeker has just been executed, and with 5 players alive, town goes to sleep. Tonight, no kills happen. Mangler wakes and chooses last good player Calamity and dead Cutthroat. There are no more living good players, so game ends.",
      "Apostle has just been executed, and with 4 players alive, town goes to sleep. Tonight, Mangler doesn't wake.",
      "Players go to sleep with 5 players alive. Cutthroat kills the Calamity during night, and thus Mangler doesn't wake."
    ]
  },
  {
    "image": "https://raw.githubusercontent.com/JulGvoz/twisted-fates/master/arranged/apostle.png",
    "id": "apostle",
    "team": "fatebound",
    "name": "Apostle",
    "firstNight": 0,
    "otherNight": 55,
    "reminders": [
      "Nominated 1st"
    ],
    "ability": "Each night* you become the alignment of the 1st player who nominated today. When the game ends, you become fated.",
    "blurb": "Apostle carries out their mission at any cost.",
    "explanations": [
      "If Apostle dies as good or evil, they will stay good or evil even if game ends.",
      "If the game ends with good or evil winning, Apostle turns fated and loses instead.",
      "Apostle turning fated due to game ending cannot continue the game.",
      "If Apostle would win, but turns fated, they lose, unless all good are dead too.",
      "If Apostle is the last remaining player of a team and die, they remain that alignment.",
      "If Apostle is the last remaining player of a team and changes alignement, game ends and then apostle turns fated."
    ],
    "examples": [
      "On the 1st day, Cutthroat nominated 1st that day. That night, Apostle turned evil. Seeker nominated 1st today. Apostle turns fated tonight.",
      "Good Apostle is the last evil player alive. Last fated player is executed, and game ends. Evil has won, but Apostle has turned fated because game has ended. Thus, fated (including Apostle) and good have lost, and evil have won.",
      "Apostle is executed on the 1st day. The following day, Cutthroat nominates 1st and executes the Calamity, thus Apostle is now alive. Tonight, Apostle turns evil, because an evil player nominated first. (Even if Apostle was dead at that time)"
    ]
  },
  {
    "image": "https://raw.githubusercontent.com/JulGvoz/twisted-fates/master/arranged/fated.png",
    "id": "fated",
    "team": "fatebound",
    "name": "Fated",
    "remindersGlobal": [
      "Fated"
    ],
    "ability": "Global reminder for Fated team.",
    "hidden": true
  }
]